package com.example.topinterview.easy.array;

import java.util.HashSet;
import java.util.Set;

/**
 * @description: 有效的数独
 * 判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。
 * <p>
 * 数字 1-9 在每一行只能出现一次。
 * 数字 1-9 在每一列只能出现一次。
 * 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。
 * <p>
 * 数独部分空格内已填入了数字，空白格用 '.' 表示。
 * <p>
 * 示例 1:
 * <p>
 * 输入:
 * [
 * ["5","3",".",".","7",".",".",".","."],
 * ["6",".",".","1","9","5",".",".","."],
 * [".","9","8",".",".",".",".","6","."],
 * ["8",".",".",".","6",".",".",".","3"],
 * ["4",".",".","8",".","3",".",".","1"],
 * ["7",".",".",".","2",".",".",".","6"],
 * [".","6",".",".",".",".","2","8","."],
 * [".",".",".","4","1","9",".",".","5"],
 * [".",".",".",".","8",".",".","7","9"]
 * ]
 * 输出: true
 * 示例 2:
 * <p>
 * 输入:
 * [
 * ["8","3",".",".","7",".",".",".","."],
 * ["6",".",".","1","9","5",".",".","."],
 * [".","9","8",".",".",".",".","6","."],
 * ["8",".",".",".","6",".",".",".","3"],
 * ["4",".",".","8",".","3",".",".","1"],
 * ["7",".",".",".","2",".",".",".","6"],
 * [".","6",".",".",".",".","2","8","."],
 * [".",".",".","4","1","9",".",".","5"],
 * [".",".",".",".","8",".",".","7","9"]
 * ]
 * 输出: false
 * 解释: 除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。
 * 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
 * 说明:
 * <p>
 * 一个有效的数独（部分已被填充）不一定是可解的。
 * 只需要根据以上规则，验证已经填入的数字是否有效即可。
 * 给定数独序列只包含数字 1-9 和字符 '.' 。
 * 给定数独永远是 9x9 形式的。
 * @author: icecrea
 * @create: 2019-02-26 11:31
 **/
public class array30_isValidSudoku {
    /**
     * 通过计算可知，当行号为 i，列号为 j 的时候，所处的子九宫格号为 k = i / 3 * 3 + j / 3，
     * 比如第3行第2列处在第3个子九宫格中
     * @param board
     * @return
     */
    public boolean isValidSudoku(char[][] board) {
        Set<Character> rowSet = new HashSet<>();
        Set<Character> lineSet = new HashSet<>();
        Set<Character> sudokuSet = new HashSet<>();

        int k = 0;
        int x, y;

        for (int i = 0; i < 9; i++) {
            rowSet.clear();
            lineSet.clear();
            sudokuSet.clear();
            for (int j = 0; j < 9; j++) {
                if (board[i][j] != '.' && !rowSet.add(board[i][j])) {
                    return false;
                }

                if (board[j][i] != '.' && !lineSet.add(board[j][i])) {
                    return false;
                }

                //第一圈循环 x： 0 0 0 1 1 1 2 2 2
                x = (i / 3) * 3 + (k % 9) / 3;
                //第一圈循环 y:  0 1 2
                y = j % 3 + ((k / 9) % 3) * 3;

                if (board[x][y] != '.' && !sudokuSet.add(board[x][y])) {
                    return false;
                }
                k += 1;
            }
        }
        return true;
    }
}
